app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = $1 AND (titulo LIKE '%%' OR status LIKE '%%' OR relatorio LIKE '%%' OR edited_by LIKE '%%' OR nome_grupo LIKE '%%' OR local_realizacao_atividade LIKE '%%' OR relatorio LIKE '%%' OR status LIKE '%%' OR feedback LIKE '%%' OR edited_by LIKE '%%' OR nome_do_evento LIKE '%%') ORDER BY "activities"."status" DESC  [["user_id", 2]]
SELECT COUNT(*) FROM "activities" WHERE (nome_usuario = 'teste')
---
  def index
    if current_user.role == "admin"
        @activities = Activity.order(status: :DESC).where("titulo LIKE :search OR status LIKE :search OR relatorio LIKE :search OR edited_by LIKE :search OR nome_grupo LIKE :search OR local_realizacao_atividade LIKE :search OR relatorio LIKE :search OR status LIKE :search OR feedback LIKE :search OR edited_by LIKE :search OR nome_usuario LIKE :search OR nome_do_evento LIKE :search", search: "%#{params[:search]}%")
        @user = User.order(status: :DESC).where("nome LIKE :search", search: "%#{params[:search]}%")
        if @activities.exists? || @user.exists?
        else
          @activities = Activity.order(status: :DESC).where("titulo LIKE :search OR status LIKE :search OR relatorio LIKE :search OR edited_by LIKE :search OR nome_grupo LIKE :search OR local_realizacao_atividade LIKE :search OR relatorio LIKE :search OR status LIKE :search OR feedback LIKE :search OR edited_by LIKE :search OR nome_usuario LIKE :search OR nome_do_evento LIKE :search", search: "%#{params[:search]}%".titleize)
          @user = User.order(status: :DESC).where("nome LIKE :search", search: "%#{params[:search]}%".titleize)
          if @activities.exists? || @user.exists?
          else
            @activities = Activity.order(status: :DESC).where("titulo LIKE :search OR status LIKE :search OR relatorio LIKE :search OR edited_by LIKE :search OR nome_grupo LIKE :search OR local_realizacao_atividade LIKE :search OR relatorio LIKE :search OR status LIKE :search OR feedback LIKE :search OR edited_by LIKE :search OR nome_usuario LIKE :search OR nome_do_evento LIKE :search", search: "%#{params[:search]}%".titleize)
            @user = User.order(status: :DESC).where("nome LIKE :search", search: "%#{params[:search]}%".titleize)
          end
        end

     else
      @usuario = current_user.nome
      @activities = current_user.activities.order(status: :DESC).where("titulo LIKE :search OR status LIKE :search OR relatorio LIKE :search OR edited_by LIKE :search OR nome_grupo LIKE :search OR local_realizacao_atividade LIKE :search OR relatorio LIKE :search OR status LIKE :search OR feedback LIKE :search OR edited_by LIKE :search OR nome_do_evento LIKE :search", search: "%#{params[:search]}%")
      @atividades_cadastradas = Activity.where("nome_usuario = '"+ @usuario +"'").count